# CSI3007_LAB_14_22MID0181
# DATE:19/09/2025

In [11]:
!pip install openpyxl # to convert csv file to excel 
df = pd.read_csv("StudentsPerformance.csv")
df.to_excel("StudentsPerformance.xlsx", index=False)

[notice] A new release of pip is available: 25.1.1 -> 25.2
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: openpyxl in c:\users\jaira\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\jaira\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)

In [13]:
df.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [16]:
import pandas as pd

# Step 1: Read Excel file
df = pd.read_excel("StudentsPerformance.xlsx")

In [17]:
# Step 2: Extract contents (students who scored > 80 in math)
query_result = df[df["math score"] > 80]

In [18]:
# Step 3: Write the output to a new Excel file
query_result.to_excel("High_Math_Scorers.xlsx", index=False)

print("Query result saved to High_Math_Scorers.xlsx")

Query result saved to High_Math_Scorers.xlsx

In [14]:
# Load the saved Excel file
result_from_file = pd.read_excel("High_Math_Scorers.xlsx")

# Print the saved result
print(result_from_file)

     gender race/ethnicity parental level of education         lunch  \
0    female        group B             master's degree      standard
1    female        group B                some college      standard
2      male        group C                 high school      standard
3      male        group E                some college      standard
4      male        group E          associate's degree      standard
..      ...            ...                         ...           ...
171  female        group C          associate's degree      standard
172    male        group D            some high school      standard
173    male        group E            some high school      standard
174    male        group E                 high school  free/reduced
175  female        group E             master's degree      standard

    test preparation course  math score  reading score  writing score
0                      none          90             95             93
1                 completed          88             95             92
2                      none          88             89             86
3                      none          97             87             82
4                 completed          81             81             79
..                      ...         ...            ...            ...
171                    none          91             95             94
172                    none          81             78             78
173               completed          81             75             76
174               completed          86             81             75
175               completed          88             99             95

[176 rows x 8 columns]

In [15]:
result_from_file.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,master's degree,standard,none,90,95,93
1,female,group B,some college,standard,completed,88,95,92
2,male,group C,high school,standard,none,88,89,86
3,male,group E,some college,standard,none,97,87,82
4,male,group E,associate's degree,standard,completed,81,81,79

In [28]:
import pandas as pd

# Example data
data = {
    "Name": ["Agnes", "jayanth", "latha","edwin"],
    "Score": [85,92,78,94],
    "Subject": ["Math", "Science", "English","tamil"]
}

df = pd.DataFrame(data)

# Save DataFrame to JSON file
df.to_json("students.json", orient="records", indent=4)

print("Data written to json file")

Data written to json file

In [32]:
#Parse JSON File and Search for a Value
import json

# Open and load JSON file
with open("students.json", "r") as file:
    students = json.load(file)

# Search: Find jayanth's score
for student in students:
    if student["Name"] == "jayanth":
        print("jayanth's Score:", student["Score"])

jayanth's Score: 92

In [33]:
df_json = pd.read_json("students.json")
print(df_json)

      Name  Score  Subject
0    Agnes     85     Math
1  jayanth     92  Science
2    latha     78  English
3    edwin     94    tamil

In [34]:
df_json.head()

      Name  Score  Subject
0    Agnes     85     Math
1  jayanth     92  Science
2    latha     78  English
3    edwin     94    tamil